[
	{
		"title": "Michael HIll",
		"description": "During my tenure at Michael Hill, I made significant contributions to the main website, where I established architectural patterns and conventions. I worked on various projects, integrating the OCAPI API to support our Nuxt framework. Additionally, I led the rebranding of the site and successfully managed to deliver during the time frame. I also introduced Tailwind as our CSS framework and provided training to other team members.",
		"src": "/img/michael-hill.png",
		"href": "https://www.michaelhill.com.au/"
	},
	{
		"title": "Mcgrath",
		"description": "The District Group produced the IA, UX, and UI for the McGrath digital experience. As part of this collaborative project, I spearheaded the front-end development to optimize the site's functionality within the Sitecore content management system. Leveraging an insightful content strategy and Sitecore’s personalization capabilities, we ensured that users receive tailored, relevant information with each visit to the McGrath site.",
		"src": "/img/mcgrath.png",
		"href": "https://www.ping-works.com.au/work/showcase/mcgrath-website"
	},
	{
		"title": "National Rugby League",
		"description": "During my time working with the NRL I updated the main NRL website and team websites using vue apps, handlebars, Fractal and custom css frameworks. I have also been in charge of updating the front end development process and adding new features, like our webpack bundler and migrating some apps to Vue 3.",
		"src": "/img/nrl-website.png",
		"href": "https://www.nrl.com/"
	},
	{
		"title": "Asteroids 1979",
		"description": "Asteroids 1979 is a classic arcade shooter built in vanilla JavaScript and HTML5 Canvas—no libraries required. A lean game loop powered by requestAnimationFrame drives smooth 60 FPS rendering, while custom vector-math handles ship thrust, rotation, and asteroid collision detection. Players steer with arrow keys and fire with the spacebar against rising waves of rocks, and the game world scales in difficulty as you rack up points. Underneath the retro pixel-art and chiptune blips lives a creative-writing experiment: Responsive input handling and touch support ensure the game feels at home on desktop or mobile, making Asteroids 1979 both a technical showcase of pure JavaScript game architecture and an unexpected canvas for storytelling.",
		"src": "/img/asteroids-1979.png",
		"href": "https://asteroidsjavascript-imjarjjxzw.now.sh/"
	},
	{
		"title": "Recursive App",
		"description": "is a Vue 3 + TresJS demo that brings a conceptual smartphone to life in a swirling particle vortex. Under the hood it uses raw WebGL via custom GLSL vertex & fragment shaders to animate thousands of particles around a PBR-textured phone model. Interactive drag-to-rotate and scroll-to-zoom controls make the scene feel tactile, and responsive layout breaks seamlessly between desktop and mobile, with performance optimizations (InstancedMesh, adaptive frame-rate) to keep it running smoothly on any device.",
		"src": "/img/recursive-app.png",
		"href": "https://vue-3d-nebula-app.vercel.app/"
	},
	{
		"title": "Earth Moon System",
		"description": "An example of using Three.js to create an scene with the Earth and the Moon. The user can rotate the scene and zoom in and out. Responsive and mobile friendly.",
		"src": "/img/earth-moon.png",
		"href": "https://misaelmp.github.io/Earth_Moon_System/"
	},
	{
		"title": "Soundscape",
		"description": "An excercies using websockets, p5.js, ruby, node and js.",
		"src": "/img/soundscape.png",
		"href": "https://misaelmp.github.io/Drawing_and_sound_app/"
	},
	{
		"title": "Park Victoria",
		"description": "As part of CodeHouse group, I was responsible for the front-end development of the Parks Victoria website. I worked closely with the design team to ensure that the site’s functionality was optimized for the Sitecore content management system. The site was designed to be user-friendly and engaging, with a focus on providing users with relevant information about Victoria’s parks and reserves",
		"src": "/img/parks-victoria.png",
		"href": "https://www.parks.vic.gov.au/"
	}
]
